
"""
Домашнее задание №1.
"""

"""
***********************************************
1. Есть список [1, 2, 3, 4, 5, 6, 7, 8, 9].
Нужно создать список [1, 3, 5, 7, 9] из предыдущего одной строкой кода.
***********************************************
"""
print [i for i in [1,2,3,4,5,6,7,8,9][::2]]

"""
***********************************************
2.1. Есть список [1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1].
Нужно создать новый список на основании текущего, в котором не будут повторятся элементы, одной строкой.
(сохранение упорядоченности не важно)
***********************************************
"""
print list(set([1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1]))

"""
***********************************************
2.2. Есть список [1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1].
Нужно удалить повторяемые элементы, не создавая новый список.
***********************************************
"""
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1]
for i in range(len(a)):
  if a[i] in a[:i]:
    a[i] = '*'
while '*' in a:
  a.remove('*')
print a

"""
***********************************************
2.3. Есть список [1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1].
Четные значения элементов поднести к степени 2. (без создания нового списка)
***********************************************
"""
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1]
for i in range(len(b)):
  if not b[i] % 2:
    b[i]**=2
print b

"""
***********************************************
3. Если выписать все натуральные числа меньше 10, кратные 3 или 5, то получим 3, 5, 6 и 9. Сумма этих чисел 23.
Найдите сумму всех чисел меньше 1000, кратных 3 или 5. Желательно одной строкой.
***********************************************
"""
print sum([i for i in range(1000) if not(i % 3) or not(i % 5)])

"""
***********************************************
4. Напишите функцию, которая ожидает введения пользователем текста и возвращает кортеж с четырьмя числами:
количество цифр, количество букв в нижнем регистре, количество букв в верхнем регистре, количество остальных символов
***********************************************
"""
from string import ascii_uppercase as upp, ascii_lowercase as low
d = raw_input()
print tuple([len([x for x in d if x in '1234567890']),len([x for x in d if x in low]),len([x for x in d if x in upp]),len([x for x in d if x not in low and x not in upp and x not in '1234567890'])])


